{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"x:0": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "rate:0": {"name": "rate:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}}, "outputs": {"predict:0": {"name": "predict:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/truediv/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Variable_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "predict/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "MatMul", "op": "MatMul", "input": ["x", "Variable"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "sub", "op": "Sub", "input": ["dropout/truediv/x", "rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["MatMul", "Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/sub", "op": "Sub", "input": ["dropout/truediv/x", "sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Shape", "op": "Shape", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout/truediv", "op": "RealDiv", "input": ["dropout/truediv/x", "dropout/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "dropout/mul", "op": "Mul", "input": ["add", "dropout/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/GreaterEqual", "op": "GreaterEqual", "input": ["dropout/random_uniform/RandomUniform", "sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Cast", "op": "Cast", "input": ["dropout/GreaterEqual"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_BOOL"}}}, {"name": "dropout/mul_1", "op": "Mul", "input": ["dropout/Cast", "dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tanh", "op": "Tanh", "input": ["dropout/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["Tanh", "Variable_2"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["MatMul_1", "Variable_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/mul", "op": "Mul", "input": ["add_1", "dropout/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Shape", "op": "Shape", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_1/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_1/Shape"], "attr": {"T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "seed": {"i": "0"}}}, {"name": "dropout_1/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_1/random_uniform/RandomUniform", "sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Cast", "op": "Cast", "input": ["dropout_1/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/mul_1", "op": "Mul", "input": ["dropout_1/Cast", "dropout_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tanh_1", "op": "Tanh", "input": ["dropout_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_2", "op": "MatMul", "input": ["Tanh_1", "Variable_4"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "AddV2", "input": ["MatMul_2", "Variable_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "predict", "op": "ArgMax", "input": ["add_2", "predict/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Variable", "shape": [2, 30], "dtype": "float32"}, {"name": "Variable_1", "shape": [30], "dtype": "float32"}, {"name": "Variable_5", "shape": [6], "dtype": "float32"}, {"name": "dropout/truediv/x", "shape": [], "dtype": "float32"}, {"name": "Variable_2", "shape": [30, 30], "dtype": "float32"}, {"name": "Variable_3", "shape": [30], "dtype": "float32"}, {"name": "Variable_4", "shape": [30, 6], "dtype": "float32"}, {"name": "predict/dimension", "shape": [], "dtype": "int32"}]}]}